Loads a family and all its types/symbols.
 Overload List
Name  |   Description
LoadFamily(String)
 Loads an entire family and all its types/symbols into the document.
LoadFamily(Document)
 Loads the contents of this family document into another document.
LoadFamily(String, Family )
 Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
LoadFamily(Document, IFamilyLoadOptions)
 Loads the contents of this family document into another document.
LoadFamily(String, IFamilyLoadOptions, Family )
 Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 See Also
  Document Class
  Document Members
  Autodesk.Revit.DB Namespace